---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Insert(Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction)
source: html/cafd2591-961a-caaf-41d4-10672f4afbeb.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Insert Method

Insert the specified MEPBuildingConstruction into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	MEPBuildingConstruction item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction`) - The MEPBuildingConstruction to be inserted into the set.

## Returns
Returns whether the MEPBuildingConstruction was inserted into the set.